# MODE BY - SACHIN SANATANI

class Helper(object):
    HELP_MAIN = '''
❖ ᴄʜσσsє ᴛʜє ᴄᴧᴛєɢσʀʏ ғσʀ ᴡʜɪᴄʜ ʏσυ ᴡᴧηηᴧ ɢєᴛ ʜєʟᴩ
ᴧsᴋ ʏσυʀ ᴅσυʙᴛs ᴧᴛ sυᴘᴘσʀᴛ ᴄʜᴧᴛ
ᴧʟʟ ᴄσϻϻᴧηᴅs ᴄᴧη ʙє υsєᴅ ᴡɪᴛʜ : /
'''

    HELP_SUPPORT = '''
**❖ ᴄʟɪᴄᴋ ᴏɴ ᴛʜᴇ ʙᴜᴛᴛᴏɴ ᴛᴏ ɢᴇᴛ ᴍᴏʀᴇ ᴀʙᴏᴜᴛ ᴍᴇ

❍ ɪғ ʏᴏᴜ ғɪɴᴅ ᴀɴʏ ᴇʀʀᴏʀ ᴏʀ ʙᴜɢ ᴏɴ ʙᴏᴛ ᴏʀ ᴡᴀɴᴛ ᴛᴏ ɢɪᴠᴇ ᴀɴʏ ғᴇᴇᴅʙᴀᴄᴋ ᴀʙᴏᴜᴛ ᴛʜᴇ ʙᴏᴛ ᴛʜᴇɴ ʏᴏᴜ ᴀʀᴇ ᴡᴇʟᴄᴏᴍᴇ ᴛᴏ [sᴜᴘᴘᴏʀᴛ ᴄʜᴀᴛ](https://t.me/btw_moon)**
'''

    HELP_ABOUTt = '''
**❖ ๏ ʟᴇᴛ's ɪɴᴛʀᴏᴅᴜᴄᴇ [Moon](https://t.me/btw_moon) ʙᴏᴛ

➻ [Moon](https://t.me/btw_moon)  ɪs ᴏɴᴇ ᴏғ ᴛʜᴇ ʙᴇsᴛ ᴍᴜsɪᴄ | ᴠɪᴅᴇᴏ sᴛꝛᴇᴀᴍɪɴɢ ʙᴏᴛ ᴏɴ ᴛᴇʟᴇɢꝛᴧᴍ ғᴏꝛ ʏᴏᴜꝛ ɢꝛᴏᴜᴘs ᴀɴᴅ ᴄʜᴧɴɴᴇʟ

๏ ᴡʜʏ [˹ Moon ˼](https://t.me/btw_moon) ɪs ʙᴇsᴛ ?

➻ ʙᴇsᴛ sᴏᴜɴᴅ ǫᴜᴀʟɪᴛʏ
➻ ᴍᴜsɪᴄ ʙᴏᴛ ғᴇᴀᴛᴜʀᴇs
➻ ɴᴏ ʏᴛ ɪᴘ ʙʟᴏᴄᴋ ɪssᴜᴇ
➻ ʙᴧsᴇᴅ ᴏɴ ɴᴇᴡ ᴠᴇꝛsɪᴏɴ ᴏғ ᴘʏꝛᴏ-ɢꝛᴧᴍ
➻ ɴᴏ ᴘꝛᴏᴍᴏᴛɪᴏɴᴧʟ ᴧᴅs | ʜɪɢʜ ᴜᴘ-ᴛɪᴍᴇ 
➻ ʜɪɢʜ ɪɴғꝛᴧsᴛꝛᴜᴄᴛᴜꝛᴇ sᴇꝛᴠᴇꝛ
➻ ꝛᴇ-ᴇᴅɪᴛᴇᴅ ᴄᴏꝛᴇ | ʜɪɢʜʟʏ ᴏᴘᴛɪᴍɪsᴇ
➻ ɴᴏ ᴍᴏꝛᴇ ʟᴧɢ ᴀɴᴅ ᴅᴏᴡɴ-ᴛɪᴍᴇ
➻ ᴍᴀɴʏ ᴍᴏʀᴇ ғᴇᴀᴛᴜʀᴇs........

ᴀʟʟ ᴛʜᴇ ғᴇᴀᴛᴜʀᴇs ᴀʀᴇ ᴡᴏʀᴋɪɴɢ ғɪɴᴇ

❖ JOIN [CHANNEL](https://t.me/btw_moon) |×| [GROUP](https://t.me/+zOo21P9qDW4wZjk1)**
'''


    HELP_GUIDE = '''
**❖ ʜᴇʏ ᴅᴇᴀʀ ᴛʜɪs ɪs ᴀ ǫᴜɪᴄᴋ ᴀɴᴅ sɪᴍᴘʟᴇ ɢᴜɪᴅᴇ ᴛᴏ ᴜsɪɴɢ [Moon](https://t.me/btw_moon)

1) ᴄʟɪᴄᴋ ᴏɴ ᴛʜᴇ 'ᴀᴅᴅ ᴍᴇ ᴛᴏ ʏᴏᴜʀ ɢʀᴏᴜᴘ' ʙᴜᴛᴛᴏɴ
2) sᴇʟᴇᴄᴛ ʏᴏᴜʀ ɢʀᴏᴜᴘ ɴᴀᴍᴇ
3) ɢʀᴀɴᴛ ᴛʜᴇ ʙᴏᴛ ᴀʟʟ ɴᴇᴄᴇssᴀʀʏ ᴘᴇʀᴍɪssɪᴏɴs ғᴏʀ sᴍᴏᴏᴛʜ ᴀɴᴅ ғᴜʟʟ ғᴜɴᴄᴛɪᴏɴᴀʟɪᴛʏ

ᴛᴏ ᴀᴄᴄᴇss ᴄᴏᴍᴍᴀɴᴅs, ʏᴏᴜ ᴄᴀɴ ᴄʜᴏᴏsᴇ ʙᴇᴛᴡᴇᴇɴ ᴍᴜsɪᴄ ᴘʀᴇғᴇʀᴇɴᴄᴇs
ɪғ ʏᴏᴜ sᴛɪʟʟ ғᴀᴄᴇ ᴀɴʏ ɪssᴜᴇs, ғᴇᴇʟ ғʀᴇᴇ ᴛᴏ ʀᴇᴀᴄʜ ᴏᴜᴛ ғᴏʀ sᴜᴘᴘᴏʀᴛ**
'''


    HELP_DONATE = '''
**❖ ʜᴇʏ, ɪ ᴀᴍ ɢʟᴀᴅ ᴛᴏ ᴋɴᴏᴡ ʏᴏᴜ ᴀʀᴇ ɪɴᴛᴇʀᴇsᴛᴇᴅ ɪɴ ᴅᴏɴᴀᴛɪɴɢ ᴜs ᴛʜᴀᴛ ᴍᴇᴀɴ ᴀ ʟᴏᴛ :)

ᴡᴇ ᴘʀᴏᴠɪᴅᴇ 24×7 ᴍᴜsɪᴄ sᴇʀᴠɪᴄᴇ sᴏ ᴡᴇ ᴀʟsᴏ ɴᴇᴇᴅ sᴏᴍᴇ ʜᴇʟᴘ ғᴏʀ ɪᴛ, ᴅᴏɴᴀᴛᴇ ɴᴏᴡ ᴠɪᴀ :-
• ᴜᴘɪ ɪᴅ » **`@btw_moon`
**• ǫʀ ᴄᴏᴅᴇ » [ᴛᴀᴘ ᴛᴏ sᴇᴇ ǫʀ ᴄᴏᴅᴇ](https://t.me/btw_moon/557) **
**• ʏᴏᴜ ᴄᴀɴ ᴀʟsᴏ ᴅᴏɴᴀᴛᴇ ʙʏ ᴄᴏɴᴛᴀᴄᴛɪɴɢ [ᴅᴇᴠᴇʟᴏᴘᴇʀ](https://t.me/moon_m_5) 

ʏᴏᴜʀ sᴍᴀʟʟ ᴀᴍᴏᴜɴᴛ ᴄᴀɴ ʜᴇʟᴘ ᴜs ᴀɴᴅ sᴀɴᴀᴛᴀɴɪ ᴛᴏ ɢʀᴏᴡ ᴍᴏʀᴇ**
'''
        
        
    HELP_PROMOTION = '''
**ʜєʏ,

ɪ ᴧϻ [ᴧηηɪє ʙσᴛ](https://t.me/shayariAlfaazonKaAaina) ✨
ɪ ᴧϻ ᴄꝛєᴧᴛєᴅ ᴡɪᴛʜ ʟσᴠє ʙʏ ϻʏ [🇲σ᭡፝֟ɳ🌙](https://t.me/about_ur_moonshining/5)❤.**
'''
    HELP_ALLBOT = '''
**❖ ๏ ʟᴇᴛ's ɪɴᴛʀᴏᴅᴜᴄᴇ [ᴧηηɪЄ-ᴍᴜsɪᴄ ʙᴏᴛ](https://t.me/shayariAlfaazonKaAaina)

➻ ᴧηηɪЄ-ᴍᴜsɪᴄ  ɪs ᴏɴᴇ ᴏғ ᴛʜᴇ ʙᴇsᴛ ᴍᴜsɪᴄ | ᴠɪᴅᴇᴏ sᴛꝛᴇᴀᴍɪɴɢ ʙᴏᴛ ᴏɴ ᴛᴇʟᴇɢꝛᴧᴍ ғᴏꝛ ʏᴏᴜꝛ ɢꝛᴏᴜᴘs ᴀɴᴅ ᴄʜᴧɴɴᴇʟ

๏ ᴡʜʏ [˹ ᴧηηɪЄ ᴍᴜsɪᴄ ˼](https://t.me/kittyxupdates) ɪs ʙᴇsᴛ ?

➻ ʙᴇsᴛ sᴏᴜɴᴅ ǫᴜᴀʟɪᴛʏ
➻ ᴍᴜsɪᴄ ʙᴏᴛ ғᴇᴀᴛᴜʀᴇs
➻ ɴᴏ ʏᴛ ɪᴘ ʙʟᴏᴄᴋ ɪssᴜᴇ
➻ ʙᴧsᴇᴅ ᴏɴ ɴᴇᴡ ᴠᴇꝛsɪᴏɴ ᴏғ ᴘʏꝛᴏ-ɢꝛᴧᴍ
➻ ɴᴏ ᴘꝛᴏᴍᴏᴛɪᴏɴᴧʟ ᴧᴅs | ʜɪɢʜ ᴜᴘ-ᴛɪᴍᴇ 
➻ ʜɪɢʜ ɪɴғꝛᴧsᴛꝛᴜᴄᴛᴜꝛᴇ sᴇꝛᴠᴇꝛ
➻ ꝛᴇ-ᴇᴅɪᴛᴇᴅ ᴄᴏꝛᴇ | ʜɪɢʜʟʏ ᴏᴘᴛɪᴍɪsᴇ
➻ ɴᴏ ᴍᴏꝛᴇ ʟᴧɢ ᴀɴᴅ ᴅᴏᴡɴ-ᴛɪᴍᴇ
➻ ᴍᴀɴʏ ᴍᴏʀᴇ ғᴇᴀᴛᴜʀᴇs........

ᴀʟʟ ᴛʜᴇ ғᴇᴀᴛᴜʀᴇs ᴀʀᴇ ᴡᴏʀᴋɪɴɢ ғɪɴᴇ

❖ ᴊσɪη [ᴄʜᴧηηЄʟ](https://t.me/kittyxupdates) |×| [ɢꝚσυᴘ](https://t.me/grandxmasti)**
'''
    HELP_ABOUT = '''
**ʜᴇʏ! ᴛʜɪs ɪs ᴀ ǫᴜɪᴄᴋ ᴀɴᴅ sɪᴍᴘʟᴇ ɢᴜɪᴅᴇ ᴛᴏ ᴜsɪɴɢ [˹𝐊íԵԵყ ✘ 𝙼ᴜsɪᴄ˼](https://t.me/shayariAlfaazonKaAaina) 🎉

1. ᴄʟɪᴄᴋ ᴏɴ ᴛʜᴇ 'ᴀᴅᴅ ᴍᴇ ᴛᴏ ʏᴏᴜʀ ᴄʟᴀɴ' ʙᴜᴛᴛᴏɴ.
2. sᴇʟᴇᴄᴛ ʏᴏᴜʀ ɢʀᴏᴜᴘ ɴᴀᴍᴇ.
3. ɢʀᴀɴᴛ ᴛʜᴇ ʙᴏᴛ ᴀʟʟ ɴᴇᴄᴇssᴀʀʏ ᴘᴇʀᴍɪssɪᴏɴs ғᴏʀ sᴍᴏᴏᴛʜ ᴀɴᴅ ғᴜʟʟ ғᴜɴᴄᴛɪᴏɴᴀʟɪᴛʏ.

ᴛᴏ ᴀᴄᴄᴇss ᴄᴏᴍᴍᴀɴᴅs, ʏᴏᴜ ᴄᴀɴ ᴄʜᴏᴏsᴇ ʙᴇᴛᴡᴇᴇɴ ᴍᴜsɪᴄ ᴏʀ ᴍᴀɴᴀɢᴇᴍᴇɴᴛ ᴘʀᴇғᴇʀᴇɴᴄᴇs.
ɪғ ʏᴏᴜ sᴛɪʟʟ ғᴀᴄᴇ ᴀɴʏ ɪssᴜᴇs, ғᴇᴇʟ ғʀᴇᴇ ᴛᴏ ʀᴇᴀᴄʜ ᴏᴜᴛ ғᴏʀ [sᴜᴘᴘᴏʀᴛ](https://t.me/shayariAlfaazonKaAaina)✨**
'''

    HELP_GUIDEBOT = '''
**ᴡє ʜᴧᴠє ᴧᴅᴅєᴅ σꝛ υᴘɢꝛᴧᴅєᴅ ᴛʜє ғσʟʟσᴡɪηɢ ᴘʟυɢɪηs ɢɪᴠєη ʙєʟσᴡ ✨

• ᴧᴅᴅєᴅ ᴧɪ ꝛєsᴘσηsє ᴧηᴅ ᴧɪ ɪϻɢ(ᴄʜᴧᴛ-ɢᴘᴛ).
• ᴧᴅᴅєᴅ ǫυσᴛʟʏ.
• ᴧᴅᴅєᴅ єϻσᴊɪ ɢᴧϻє.
• υᴘᴅᴧᴛє ʜσᴡsᴧʟʟ, ᴊυᴅɢє, ᴡɪsʜ, ᴧғᴋ ғєᴧᴛυꝛє.
• υᴘᴅᴧᴛє ᴡꝛɪᴛє, ʙυɢ ᴧηᴅ ғєᴅꝛᴧᴛɪση ᴛσσʟs.
• ᴧᴅᴅєᴅ ɢɪғ ᴧηᴅ ᴧηɪϻᴧᴛєᴅ sᴛɪᴄᴋєꝛ ᴋᴧηɢ ᴧʟsσ.
• ᴧᴅᴅєᴅ ᴡєʙsɪᴛє σғ ʙσᴛ ғσꝛ ᴘꝛєᴠɪєᴡ.
• ᴧᴅᴅєᴅ ᴘɪηᴛєꝛєsᴛ,ʏᴛ ᴧηᴅ ɪηsᴛᴧ ᴠɪᴅєσ ᴅσᴡηʟσᴧᴅєꝛ.
• ᴧᴅᴅєᴅ ɪηʙυɪʟᴛ ϻυsɪᴄ sʏsᴛєϻ.

Ғσꝛ ϻσꝛє ɪηғσ ᴧʙσυᴛ [ᴧηηɪє υᴘᴅᴧᴛєs](https://t.me/kittyxupdates) ᴄʜєᴄᴋ ᴡєʙsɪᴛє 🎄👀.**
'''


    HELP_GALAXYBOT = '''
**ᴊσɪη συꝛ ɢꝛσυᴘs....🧊

Ғσꝛ ϻσꝛє ɪηғσ ᴧʙσυᴛ 
[ᴧηηɪЄ υᴘᴅᴧᴛєs](https://t.me/kittyxupdates) ᴄʜєᴄᴋ sυᴘᴘσꝛᴛ 🎄👀**
'''


    HELP_TOOL = '''
**─────────────────────────
│ ᴡєʟᴄσϻє ᴛσ ˹ 𝐁ᴏᴛs˼ ʙσᴛ sᴛᴧᴛυs │
─────────────────────────
╭⎋ ˹ ꭙ 𝐌ᴜsɪᴄ˼ : ᴧʟɪᴠє 
╰⊚ υᴘᴛɪϻє : 12ʜ:58ϻ:20s | ᴄᴘυ : 5.0% | 
       υsᴧɢє : 24 | ᴧssɪsᴛᴧηᴛs : 01

╭⎋ ˹ ꭙ 𝐌ᴜsɪᴄ˼ : ᴧʟɪᴠє 
╰⊚ υᴘᴛɪϻє : 12ʜ:58ϻ:20s | ᴄᴘυ : 5.0% | 
       υsᴧɢє : 24 | ᴧssɪsᴛᴧηᴛs : 01
─────────────────────────
⊚ ʙσᴛ sᴛᴧᴛυs ᴧηᴅ ϻσʀє ʙσᴛs - ᴄʟɪᴄᴋ ʜєʀє
─────────────────────────
⊚ ʟᴧsᴛ ᴄʜєᴄᴋєᴅ ση : ᴅᴧᴛє : 7 JUL 2025 
─────────────────────────
❍ 𝐏ᴏᴡєʀєᴅ 𝖡ʏ » 
─────────────────────────🎄👀**
'''
    
